app/controllers/posts_controller.rb

  def index
    options = {:page => params[:page] || 1, :per_page => 2}
    @posts = (params[:tag].blank? ? Post.published.search(params[:search], options) : Post.published.paginate_tagged_with(params[:tag], options))
---
SELECT * FROM `posts`